import React, { useRef, useState, useEffect } from "react";
import { CheckBox, Popup, ScrollView, Toast } from "devextreme-react";
import { ToolbarItem } from "devextreme-react/popup";
import { GetdataAPI } from "../../MainCall/MainCall";

//------------------------------------------- -DevStore/interface ------------------------------------------
interface ToasttypeFace {
  type?: "custom" | "error" | "info" | "success" | "warning";
}

export default function PopupPDPA({ toggle, fntoggle }) {
  //------------------------------------------- useRef ------------------------------------------
  const chkbox = useRef(null);
  //------------------------------------------- ตัวแปร ------------------------------------------
  const [ToastVisible, setToastVisible] = React.useState(false);
  const [ToastType, setToastType] = React.useState<ToasttypeFace>({
    type: "info",
  });
  const [Toastmessage, setToastmessage] = React.useState("");

  //------------------------------------------- function ------------------------------------------
  const approve = () => {
    if (chkbox.current.checked) {
      localStorage.setItem("chk", "0");
      setToastVisible(true);
      setToastType({ type: "success" });
      setToastmessage("ยืนยันเรียบร้อย");
      fntoggle();
    } else {
      setToastVisible(true);
      setToastType({ type: "error" });
      setToastmessage("กรุณายืนยัน");
    }
  };
  function onHiding(e) {
    setToastVisible(false);
  }
  //------------------------------------------- HTML ------------------------------------------
  return (
    <>
      <Toast
        animation={{
          show: { type: "fade", duration: 400, from: 0, to: 1 },
          hide: { type: "fade", duration: 1000, from: 1, to: 0 },
        }}
        position={{
          my: { x: "center", y: "top" },
          at: { x: "center", y: "top" },
          of: window,
          offset: "0 10",
        }}
        visible={ToastVisible}
        message={Toastmessage}
        type={ToastType.type}
        onHiding={onHiding}
        displayTime={1000}
      />

      <div className="grid grid-cols-12 ">
        <div className="grid col-span-12 sm:px-4 md:justify-center md:text-center mb-[100px] pt-[50px] p-4">
          <div className="grid grid-cols-12 gap-3">
            <div className="grid col-span-12  sm:col-span-12 md:col-span-12 lg:col-span-12 xl:col-span-12 content-start font-bold text-xl">
              <div>นโยบายออนไลน์</div>
              <div>
                เอกสารการแจ้งข้อมูลการประมวลผลข้อมูลส่วนบุคคล (PRIVACY NOTICE)
              </div>
              <div>ปรับปรุงล่าสุด 27 กรกฎาคม 2565</div>
            </div>
          </div>
          <div className="grid grid-cols-12 gap-3">
            <div className="grid col-span-12  sm:col-span-12 md:col-span-12 lg:col-span-12 xl:col-span-12 content-start mt-3 mb-4">
              เอกสารการแจ้งข้อมูลการประมวลผลข้อมูลส่วนบุคคล (PRIVACY NOTICE)
              ของเดอะ เมมโมรี่บ็อกซ์ฉบับนี้ (“เอกสารแจ้งฯ”)
              อธิบายถึงวิธีการที่บริษัท เดอะ เมมโมรี่บ็อกซ์ จำกัด (“เดอะ
              เมมโมรี่บ็อกซ์” หรือ “เรา”) เก็บรวบรวม ใช้ และเปิดเผย (“ประมวลผล”)
              ข้อมูลส่วนบุคคลของท่านผ่านเว็บไซต์และการให้บริการออนไลน์ของเรา
              รวมถึงเว็บไซต์ https://www.memorybox.store และเว็บไซต์อื่น ๆ
              ที่เดอะ เมมโมรี่บ็อกซ์เป็นเจ้าของหรือเป็นผู้ดำเนินการ
              แอปพลิเคชันในโทรศัพท์เคลื่อนที่
              และบริการออนไลน์ที่เชื่อมโยงกับเอกสารแจ้งฯ นี้ (เรียกรวมกันว่า
              “ไซต์”) ผ่านทางโปรแกรมและตลาดซื้อขายภาพถ่ายของเรา (“บริการ”)
              และผ่านบริการที่ท่านจัดหาให้และสัญญาที่เราเข้าทำกับท่าน
              เอกสารแจ้งฯ
              นี้มีวัตถุประสงค์เพื่อให้ท่านทราบถึงข้อมูลส่วนบุคคลที่เราเก็บรวบรวมเกี่ยวกับท่าน
              เหตุผลในการประมวลผลข้อมูลนั้น
              และระยะเวลาที่เราจัดเก็บข้อมูลส่วนบุคคล เอกสารแจ้งฯ
              นี้ไม่ใช้บังคับกับบรรดาเว็บไซต์และบริการซึ่งแสดงหรือเชื่อมโยงกับคำประกาศว่าด้วยความเป็นส่วนตัวอื่นที่แตกต่างออกไป
              ทั้งนี้ เว็บไซต์และบริการที่เรามีการจัดทำร่วมกับบรรดาหุ้นส่วนอื่น
              อาจแสดงหรือเชื่อมโยงกับคำประกาศว่าด้วยความเป็นส่วนตัวร่วม
              หรือคำประกาศว่าด้วยความเป็นส่วนตัวที่แยกจากกันของหุ้นส่วนของเรา
              ที่เพิ่มเติมขึ้นจากเอกสารแจ้งฯ ของเรา อนึ่ง
              โดยไม่จำกัดนัยทั่วไปของข้อความที่ได้กล่าวมาข้างต้น เดอะ
              เมมโมรี่บ็อกซ์อาจส่งหรือโอนข้อมูลของท่านออกนอกประเทศไทย
              ในลักษณะและเพื่อวัตถุประสงค์ตามที่ได้อธิบายไว้ในเอกสารแจ้งฯ
              ฉบับนี้
            </div>
          </div>
          <div className="grid grid-cols-12 gap-3">
            <div className="grid col-span-12  sm:col-span-12 md:col-span-12 lg:col-span-12 xl:col-span-12 content-start mt-3 mb-4">
              การอ้างถึงคำว่า “ท่าน” หรือ “ของท่าน” ในเอกสารแจ้งฯ นี้
              เป็นการอ้างถึงบุคคลซึ่งข้อมูลส่วนบุคคลของบุคคลนั้นถูกนำไปประมวลผลโดยเรา
              หรือในนามของเรา ในส่วนที่เกี่ยวกับกิจกรรมของเรา
              หรือในฐานะคู่สัญญาของธุรกรรม
              หรือคู่ความในกระบวนการพิจารณาทางกฎหมายที่เกี่ยวข้องกับเรา
              โปรดพิจารณารายละเอียดเพิ่มเติมในหัวข้อ
              “บุคคลที่เกี่ยวข้องกับเอกสารแจ้งฯ ฉบับนี้และบุคคลที่เรา
              ทำการรวบรวมข้อมูลส่วนบุคคล” ท้ายนี้
            </div>
          </div>
          <div className="grid grid-cols-12 gap-3">
            <div className="grid col-span-12  sm:col-span-12 md:col-span-12 lg:col-span-12 xl:col-span-12 content-start mt-3 mb-4 font-bold">
              ข้อมูลประเภทใดที่เดอะ เมมโมรี่บ็อกซ์เก็บรวบรวม?
            </div>
          </div>
          <div className="grid grid-cols-12 gap-3">
            <div className="grid col-span-12  sm:col-span-12 md:col-span-12 lg:col-span-12 xl:col-span-12 content-start mt-3 mb-4">
              <div>
                เดอะ
                เมมโมรี่บ็อกซ์อาจมีการประมวลผลข้อมูลส่วนบุคคลซึ่งทำให้สามารถระบุตัวตนของท่านได้ไม่ว่าทางตรงหรือทางอ้อม
                (“ข้อมูลส่วนบุคคล“)
                ทั้งนี้ขึ้นกับประเภทผลิตภัณฑ์หรือบริการที่เราเสนอหรือให้บริการแก่ท่าน
                โดยข้อมูลส่วนบุคคลดังกล่าวอาจรวมถึงข้อมูลดังต่อไปนี้
              </div>
              <div>
                • ข้อมูลเกี่ยวกับตัวบุคคล – ชื่อ นามสกุล ชื่อเล่น
                ตัวอย่างลายมือชื่อ วันเกิด เพศ และข้อมูลในทะเบียนบ้าน
                บัตรประจำตัวประชาชนหรือหนังสือเดินทางของท่าน
                ซึ่งมีหมายเลขประจำตัวประชาชนหรือหมายเลขหนังสือเดินทาง สัญชาติ
                และรูปถ่ายของท่าน
              </div>
              <div>
                • ข้อมูลการติดต่อ – รายละเอียดการติดต่อส่วนตัวหรือด้านวิชาชีพ
                เช่น ตำแหน่งงาน นายจ้าง ที่อยู่ และที่อยู่อีเมล หมายเลขโทรศัพท์
                และบัญชีสื่อสังคมออนไลน์
              </div>
              <div>
                • ข้อมูลด้านภาษีและการเงิน – หมายเลขประจำตัวผู้เสียภาษี
                หมายเลขบัตรเครดิต รายละเอียดบัญชีธนาคาร และข้อมูลอื่น ๆ
                ด้านการชำระเงิน
              </div>
              <div>
                • ข้อมูลด้านธุรกรรม สิทธิประโยชน์และความชื่นชอบ –
                ความชื่นชอบด้านการตลาดและการสื่อสารของท่าน
                รางวัลและสิทธิประโยชน์จาก เอ็มคอยท์ เดอะ เมมโมรี่บ็อกซ์ ของท่าน
                และประวัติการซื้อสินค้าและบริการ
              </div>
              <div>
                • ข้อมูลการสื่อสาร – ความเห็น
                คำร้องขอหรือคำร้องเรียนของท่านเกี่ยวกับผลิตภัณฑ์หรือบริการของเดอะ
                เมมโมรี่บ็อกซ์ บันทึกการสนทนาทางโทรศัพท์ บันทึกการแชต
              </div>
              <div>
                • ข้อมูลกล้องวงจรปิด –
                ข้อมูลภาพจากกล้องวงจรปิดซึ่งติดตั้งที่สำนักงานใหญ่
              </div>
              <div>
                • ข้อมูลพิกัดตำแหน่ง (geolocation) –
                เราอาจเก็บรวบรวมข้อมูลเกี่ยวกับตำแหน่งที่ตั้งของอุปกรณ์ของท่าน
                อาทิ ข้อมูลที่ระบุตำแหน่งที่อยู่ที่แน่นอนของอุปกรณ์ของท่าน (เช่น
                ค่าละติจูดและลองจิจูดในระบบพิกัดจีพีเอส)
                หรือตำแหน่งที่อยู่โดยประมาณ (เช่น
                ข้อมูลตำแหน่งที่อยู่ที่ไม่ละเอียดซึ่งประมาณค่าจากโปรแกรมที่ใช้ท่องอินเตอร์หรือเบราว์เซอร์
                (Browser) หรือหมายเลขระบุอุปกรณ์ที่เชื่อมต่อกับอินเตอร์เน็ต (IP
                Address) ของอุปกรณ์){" "}
              </div>
              <div>
                • ข้อมูลทางเทคนิค –
                หมายเลขระบุอุปกรณ์ที่เชื่อมต่อกับอินเตอร์เน็ต (IP Address)
                ข้อมูลจำเพาะทางเทคนิค
                และข้อมูลการล็อกอินที่ใช้ในการเชื่อมต่อกับเว็บไซต์หรือแอปพลิเคชันของเดอะ
                เมมโมรี่บ็อกซ์
              </div>
              <div>
                • ข้อมูลการกระทำผิดทางอาญา –
                ประวัติของท่านด้านการต้องโทษและการกระทำผิดทางอาญา
              </div>
              <div>
                • ข้อมูลด้านสุขภาพ – สถานภาพทางร่างกายและจิตใจของท่าน (เช่น โรค
                ความพิการ ความเสี่ยงในการเกิดโรค ประวัติทางการแพทย์
                ข้อมูลการรักษาพยาบาล ข้อมูลทางสรีรวิทยาหรือชีวการแพทย์)
              </div>
            </div>
          </div>
          <div className="grid grid-cols-12 gap-3">
            <div className="grid col-span-12  sm:col-span-12 md:col-span-12 lg:col-span-12 xl:col-span-12 content-start mt-3 mb-4">
              การเก็บรวบรวมข้อมูลการใช้สื่อออนไลน์ของเรา อาจมีการใช้ข้อมูลคุกกี้
              (Cookies) และเว็บบีคอน (Web Beacons) ต่าง ๆ ทั้งนี้
              คุกกี้เป็นไฟล์ข้อมูลขนาดเล็กซึ่งเว็บไซต์เก็บไว้บนฮาร์ดไดรฟ์ของอุปกรณ์ของท่าน
              โดยคุกกี้ช่วยในการปรับปรุงไซต์และประสบการณ์การใช้งานไซต์ของเรา
              เราใช้ข้อมูลคุกกี้ในการวิเคราะห์ว่าพื้นที่และคุณสมบัติการทำงานส่วนไหนของไซต์ที่ได้รับความนิยม
              และใช้นับจำนวนการเข้าชมไซต์ของเรา
              ส่วนเว็บบีคอนเป็นภาพทางอิเล็กทรอนิกส์ที่อาจนำมาใช้ในไซต์ของเรา
              หรือในอีเมลของเรา ทั้งนี้เราใช้เว็บบีคอนในการส่งคุกกี้
              นับจำนวนการเข้าชมเว็บไซต์
              วิเคราะห์การใช้งานและประสิทธิผลของแคมเปญทางการตลาด
              และใช้ระบุว่ามีการเปิดอ่านอีเมลและดำเนินการในอีเมลหรือไม่
            </div>
          </div>
          <div className="grid grid-cols-12 gap-3">
            <div className="grid col-span-12  sm:col-span-12 md:col-span-12 lg:col-span-12 xl:col-span-12 content-start mt-3 mb-4">
              นอกจากข้อมูลส่วนบุคคลของท่าน
              ในบางกรณีท่านอาจให้ข้อมูลเกี่ยวกับบุคคลอื่นแก่เรา อาทิ ชื่อ
              หมายเลขโทรศัพท์ และที่อยู่อีเมล
              รวมถึงในกรณีซึ่งท่านเข้าร่วมในแคมเปญการตลาดของเรา
              และแจ้งให้เราส่งรางวัลให้แก่บุคคลอื่น
              โปรดพิจารณารายละเอียดเพิ่มเติมในหัวข้อ
              “บุคคลที่เกี่ยวข้องกับเอกสารแจ้งฯ
              ฉบับนี้และบุคคลที่เราทำการรวบรวมข้อมูลส่วนบุคคล” ท้ายนี้
            </div>
          </div>
          <div className="grid grid-cols-12 gap-3">
            <div className="grid col-span-12  sm:col-span-12 md:col-span-12 lg:col-span-12 xl:col-span-12 content-start mt-3 mb-4">
              เราจะไม่ขอข้อมูลส่วนบุคคลที่มีความอ่อนไหว อาทิ
              ข้อมูลที่เกี่ยวกับเชื้อชาติ หรือเผ่าพันธุ์
              ศาสนาหรือความเชื่อในลัทธิ ข้อมูลสหภาพแรงงาน ความเห็นทางการเมือง
              ข้อมูลพันธุกรรม ข้อมูลชีวภาพ
              หรือข้อมูลเกี่ยวกับวิถีชีวิตทางเพศหรือพฤติกรรมทางเพศ
              เว้นแต่เป็นการจำเป็นในการดำเนินงานของเรา
              (รวมถึงการให้บริการแก่ท่าน)
              และเมื่อเรามีฐานทางกฎหมายที่สามารถกระทำได้ อนึ่ง
              ก่อนที่เราจะประมวลผลข้อมูล เราอาจปิดบัง ใส่แถบดำ
              หรือซ่อนข้อมูลของท่านในส่วนที่เห็นว่าเป็นข้อมูลส่วนบุคคลที่มีความอ่อนไหว
              และไม่จำเป็นในการดำเนินงานของเรา
              ในการนี้เราไม่มีเจตนาที่จะเปลี่ยนแปลง สร้างข้อมูลเท็จ
              หรือปลอมแปลงเอกสารหรือข้อมูลที่ได้รับจากท่านแต่ประการใด
            </div>
          </div>
          <div className="grid grid-cols-12 gap-3">
            <div className="grid col-span-12  sm:col-span-12 md:col-span-12 lg:col-span-12 xl:col-span-12 content-start mt-3 mb-4">
              เดอะ เมมโมรี่บ็อกซ์อาจเก็บรวบรวมข้อมูลโดยรวม (Aggregated Data)
              หรือข้อมูลที่ไม่สามารถระบุตัวบุคคลที่เป็นเจ้าของข้อมูล (Anonymized
              Data) ซึ่งไม่ระบุตัวตนของท่านโดยตรง
            </div>
          </div>
          <div className="grid grid-cols-12 gap-3">
            <div className="grid col-span-12  sm:col-span-12 md:col-span-12 lg:col-span-12 xl:col-span-12 content-start mt-3 mb-4">
              เราอาจรวมข้อมูลที่เก็บรวบรวมได้เกี่ยวกับท่านกับข้อมูลอื่นที่เราได้รับจากบุคคลภายนอก
            </div>
          </div>
          <div className="grid grid-cols-12 gap-3">
            <div className="grid col-span-12  sm:col-span-12 md:col-span-12 lg:col-span-12 xl:col-span-12 content-start mt-3 mb-4">
              ในบางกรณีเดอะ เมมโมรี่บ็อกซ์อาจรวมข้อมูลอื่น ๆ กับข้อมูลส่วนบุคคล
              หากมีการนำข้อมูลอื่นมารวมกับข้อมูลส่วนบุคคล
              หรือหากมีการใช้ข้อมูลอื่นเพื่อระบุตัวบุคคล
              เราจะถือว่าข้อมูลอื่นนั้นเป็นข้อมูลส่วนบุคคลด้วย
            </div>
          </div>
          <div className="grid grid-cols-12 gap-3">
            <div className="grid col-span-12  sm:col-span-12 md:col-span-12 lg:col-span-12 xl:col-span-12 content-start mt-3 mb-4 font-bold">
              ใครบ้างที่เกี่ยวข้องกับเอกสารแจ้งฯ ฉบับนี้?
            </div>
          </div>
          <div className="grid grid-cols-12 gap-3">
            <div className="grid col-span-12  sm:col-span-12 md:col-span-12 lg:col-span-12 xl:col-span-12 content-start mt-3 mb-4">
              เราทำการเก็บรวบรวมข้อมูลโดยตรงจากท่านในฐานะที่ท่านเป็น (1)
              ลูกค้าของเรา (2) ผู้ให้บริการที่เป็นบุคคลภายนอก (เช่น ผู้รับเหมา
              ผู้ผลิตและจำหน่ายสินค้าหรือบริการ บริษัทตัวแทนการตลาด
              สำนักงานกฎหมาย บริษัทนายหน้า บริษัทประกันภัย หรือผู้ค้า) (3)
              เจ้าหนี้หรือลูกหนี้ (4) เจ้าของที่ดิน (บุคคลในวรรค (1) (2) (3) และ
              (4) รวมเรียกว่า “คู่สัญญา”) หรือ (5) หน่วยงานกำกับดูแล ทั้งนี้
              เรายังอาจเก็บรวบรวมข้อมูลส่วนบุคคลโดยอ้อมเกี่ยวกับบุคคลอื่นจากท่าน
              โดยที่บุคคลอื่นนั้นไม่มีความสัมพันธ์โดยตรงกับเรา
              แต่เกี่ยวข้องกับลูกค้าและคู่สัญญาของเรา เช่น
              บุคคลดังต่อไปนี้ของลูกค้าหรือคู่สัญญาของเรา
            </div>
          </div>
          <div className="grid grid-cols-12 gap-3">
            <div className="grid col-span-12  sm:col-span-12 md:col-span-12 lg:col-span-12 xl:col-span-12 content-start mt-3 mb-4">
              <div>• ผู้ถือหุ้น</div>
              <div>• กรรมการ</div>
              <div>• ผู้แทนทางกฎหมาย</div>
              <div>• ตัวแทน</div>
              <div>• ลูกจ้าง</div>
              <div>• พนักงานผู้ทำสัญญา</div>
              <div>• บิดามารดาหรือผู้ปกครองตามกฎหมาย</div>
              <div>
                • บุคคลที่เกี่ยวข้องในการทำธุรกรรมกับลูกค้านิติบุคคลของเรา และ
              </div>
              <div>
                {" "}
                • ผู้เข้าร่วมในกิจกรรมทางการตลาด
                (เพื่อนหรือสมาชิกในครอบครัวของท่าน
                หรือบุคคลที่ได้รับสิทธิประโยชน์จากการเข้าร่วมในกิจกรรมทางการตลาดของเรา)
                เมื่อท่านได้ให้ข้อมูลส่วนบุคคลของบุคคลภายนอกกับเรา
                ดังเช่นตามตัวอย่างข้างต้น
                โปรดแจ้งแก่บุคคลที่ให้ข้อมูลว่าเรามีการประมวลผลข้อมูลส่วนบุคคลของบุคคลนั้น
                และแจ้งให้บุคคลนั้นศึกษาเอกสารแจ้งฯ ฉบับล่าสุดของเรา
              </div>
              <div>เรายังอาจได้รับข้อมูลส่วนบุคคลจากแหล่งอื่น ๆ ได้แก่</div>
              <div>
                • บุคคลภายนอก เช่น หน่วยงานกำกับดูแล หรือสำนักงานตำรวจแห่งชาติ
                เพื่อวัตถุประสงค์ในการสอบสวน
              </div>
              <div>
                • หน้าเว็บไซต์/สื่อสังคมออนไลน์ของนิติบุคคลหรือลูกค้าวิชาชีพ
                หรือจากแหล่งที่มีข้อมูลที่ท่านได้เปิดเผยต่อสาธารณะ (เช่น
                เว็บไซต์ หรือสื่อสังคมออนไลน์ของท่านเอง) และ
              </div>
              <div>• ข้อมูลสาธารณะ เช่น ข้อมูลจากสื่อมวลชน</div>
            </div>
          </div>
          <div className="grid grid-cols-12 gap-3">
            <div className="grid col-span-12  sm:col-span-12 md:col-span-12 lg:col-span-12 xl:col-span-12 content-start mt-3 mb-4 font-bold">
              กรณีที่ท่านไม่เปิดเผยข้อมูลของท่านให้เรา
            </div>
          </div>
          <div className="grid grid-cols-12 gap-3">
            <div className="grid col-span-12  sm:col-span-12 md:col-span-12 lg:col-span-12 xl:col-span-12 content-start mt-3 mb-4">
              ในกรณีที่เรามีหน้าที่ต้องประมวลผลข้อมูลส่วนบุคคลของท่านตามกฎหมาย
              หรือจำเป็นต้องประมวลผลข้อมูลส่วนบุคคลของท่านตามข้อกำหนดในสัญญาที่เราทำไว้กับท่าน
              (หรือดำเนินขั้นตอนตามคำร้องขอของท่านก่อนเข้าทำสัญญากับท่าน)
              แต่ท่านไม่เปิดเผยข้อมูลส่วนบุคคลของท่านเมื่อได้รับการร้องขอ
              เราอาจไม่สามารถปฏิบัติตามสัญญาที่เราได้ทำ หรือจะเข้าทำกับท่าน
              ในกรณีดังกล่าว เราอาจต้องปฏิเสธที่จะให้บริการที่เกี่ยวข้อง
              แต่ทั้งนี้เราจะแจ้งท่านให้ทราบหากมีกรณีเช่นนี้
            </div>
          </div>
          <div className="grid grid-cols-12 gap-3">
            <div className="grid col-span-12  sm:col-span-12 md:col-span-12 lg:col-span-12 xl:col-span-12 content-start mt-3 mb-4 font-bold">
              เดอะ เมมโมรี่บ็อกซ์ประมวลผลข้อมูลเกี่ยวกับท่านอย่างไร?
            </div>
          </div>
          <div className="grid grid-cols-12 gap-3">
            <div className="grid col-span-12  sm:col-span-12 md:col-span-12 lg:col-span-12 xl:col-span-12 content-start mt-3 mb-4">
              เราอาจประมวลผลข้อมูลส่วนบุคคลของท่านเท่าที่มีฐานทางกฎหมายในการดำเนินกิจกรรมดังกล่าว
              ทั้งนี้ เราเก็บรวบรวม ใช้
              หรือเปิดเผยข้อมูลส่วนบุคคลของท่านในกรณีต่อไปนี้
            </div>
          </div>
          <div className="grid grid-cols-12 gap-3">
            <div className="grid col-span-12  sm:col-span-12 md:col-span-12 lg:col-span-12 xl:col-span-12 content-start mt-3 mb-4 font-bold">
              (ก) เพื่อเป็นการปฏิบัติตามสัญญากับท่าน
              หรือดำเนินขั้นตอนตามคำร้องขอของท่านก่อนเข้าทำสัญญากับท่าน
            </div>
          </div>
          <div className="grid grid-cols-12 gap-3">
            <div className="grid col-span-12  sm:col-span-12 md:col-span-12 lg:col-span-12 xl:col-span-12 content-start mt-3 mb-4">
              <div>
                •
                ดำเนินการและจัดการการซื้อหรือการร้องขอผลิตภัณฑ์หรือบริการของท่าน
              </div>
              <div>• ลงทะเบียนและตรวจสอบบัญชีผู้ใช้</div>
              <div>
                • จัดหาสิทธิประโยชน์แก่สมาชิกในโครงการ เอ็มคอยท์ เดอะ
                เมมโมรี่บ็อกซ์
              </div>
              <div>• จัดหารางวัลแก่ผู้เข้าร่วมกิจกรรมทางการตลาด</div>
              <div>
                • ดำเนินงานประจำวันของเดอะ เมมโมรี่บ็อกซ์ที่เกี่ยวข้องกับท่าน
                (เช่น การเปิดบัญชีกับคู่สัญญา การทำคำสั่งซื้อ
                การจัดการชำระค่าเช่าร้านค้า ดำเนินการชำระเงินแก่คู่สัญญาปัจจุบัน
                ตรวจสอบอำนาจการอนุมัติของผู้มีอำนาจลงนาม
                และจัดเก็บหลักฐานประกอบการเข้าทำสัญญา)
              </div>
              <div>
                • ตอบข้อสอบถามของท่าน ดำเนินการกับคำร้องเรียนหรือคำร้องขอของท่าน
                หรือกระทำการอื่นเพื่อตอบสนองการสอบถามของท่าน และ
              </div>
              <div>
                • สื่อสารกับท่านเกี่ยวกับไซต์หรือบริการของเรา
                หรือการปฏิบัติตามสัญญาของเรากับท่าน
                หรือการปฏิบัติตามสัญญาของท่านกับเรา
              </div>
            </div>
          </div>
          <div className="grid grid-cols-12 gap-3">
            <div className="grid col-span-12  sm:col-span-12 md:col-span-12 lg:col-span-12 xl:col-span-12 content-start mt-3 mb-4 font-bold">
              (ข) เพื่อการปฏิบัติหน้าที่ตามกฎหมายหรือกฎระเบียบ
            </div>
          </div>
          <div className="grid grid-cols-12 gap-3">
            <div className="grid col-span-12  sm:col-span-12 md:col-span-12 lg:col-span-12 xl:col-span-12 content-start mt-3 mb-4">
              <div>
                • ร่วมมือ และสื่อสารกับหน่วยงานผู้มีอำนาจ
                และปฏิบัติตามคำสั่งที่ชอบด้วยกฎหมายของหน่วยงานตามที่จำเป็น และ
              </div>
              <div>
                • ปฏิบัติตามภาระหน้าที่ตามกฎหมายหรือกฎระเบียบซึ่งใช้บังคับกับเรา
              </div>
            </div>
          </div>
          <div className="grid grid-cols-12 gap-3">
            <div className="grid col-span-12  sm:col-span-12 md:col-span-12 lg:col-span-12 xl:col-span-12 content-start mt-3 mb-4 font-bold">
              (ค) เพื่อประโยชน์โดยชอบด้วยกฎหมายของเรา
            </div>
          </div>
          <div className="grid grid-cols-12 gap-3">
            <div className="grid col-span-12  sm:col-span-12 md:col-span-12 lg:col-span-12 xl:col-span-12 content-start mt-3 mb-4">
              <div>
                • การปฏิบัติตามสัญญาที่เราทำกับลูกค้านิติบุคคล
                หรือผู้ให้บริการยิติบุคคล
                หรือดำเนินขั้นตอนตามคำร้องขอของลูกค้านิติบุคคลหรือคู่สัญญานิติบุคคลของเราก่อนเข้าทำสัญญา
                ซึ่งรวมถึงการดำเนินการต่อไปนี้
              </div>
              <div>• จัดการกับคำร้องเรียนหรือคำร้องขอของลูกค้า</div>
              <div>• ปรับปรุงผลิตภัณฑ์หรือบริการของเดอะ เมมโมรี่บ็อกซ์</div>
              <div>
                • ดำเนินงานประจำวันของเดอะ
                เมมโมรี่บ็อกซ์ที่เกี่ยวข้องกับคู่สัญญา (เช่น
                การเปิดบัญชีกับคู่สัญญา การทำคำสั่งซื้อ
                การจัดการชำระค่าเช่าร้านค้า ดำเนินการชำระเงินแก่คู่สัญญาปัจจุบัน
                ตรวจสอบอำนาจการอนุมัติของผู้มีอำนาจลงนาม
                และจัดเก็บหลักฐานประกอบการเข้าทำสัญญา) และ
              </div>
              <div>
                • สื่อสารกับลูกค้านิติบุคคล หรือคู่สัญญานิติบุคคลของเรา
                เพื่อให้เดอะ เมมโมรี่บ็อกซ์ให้หรือได้รับบริการ ผลิตภัณฑ์
                หรือปฏิบัติหน้าที่ตามสัญญา
                หรือให้ลูกค้านิติบุคคลหรือคู่สัญญานิติบุคคลปฏิบัติหน้าที่ตามสัญญา
              </div>
              <div>
                • การวิจัย พัฒนา
                และปรับปรุงบริการของเราเพื่อช่วยในการปรับปรุงผลิตภัณฑ์และบริการในปัจจุบันของเรา
                และในการพัฒนาผลิตภัณฑ์และบริการใหม่ๆ
                เพื่อตอบสนองต่อความต้องการและความคาดหวังของท่าน
                หรือให้มากกว่าความต้องการหรือความดาดหวังของท่าน
              </div>
              <div>• การควบคุมคุณภาพของบริการ</div>
              <div>
                • โฆษณาประชาสัมพันธ์ข่าวสาร รายการส่งเสริมการขาย
                ผลิตภัณฑ์หรือบริการที่คล้ายกับผลิตภัณฑ์หรือบริการที่เสนอให้แก่สมาชิกของโครงการ
                เอ็มคอยท์ เดอะ เมมโมรี่บ็อกซ์
              </div>
              <div>
                •
                ทำการวิเคราะห์การทำการตลาดของผลิตภัณฑ์หรือบริการของเราเพื่อปรับปรุงผลิตภัณฑ์และบริการ
                และ
              </div>
              <div>• ออกใบกำกับภาษีตามที่ท่านร้องขอ</div>
              <div>
                • เหตุผลด้านความปลอดภัย (เช่น
                ข้อมูลภาพจากกล้องวงจรปิดจะถูกใช้เพื่อตรวจจับและป้องกันอาชญากรรม
                ตรวจจับและป้องกันเหตุการณ์ด้านความปลอดภัย
                ตรวจจับและป้องกันการเข้ามาในสถานที่ของเรา
                และพื้นที่หวงห้ามโดยไม่ได้รับอนุญาต
                ตรวจจับและป้องกันการประพฤติผิดอย่างร้ายแรง สนับสนุนงานความมั่นคง
                ความปลอดภัย และการสอบสวนภายใน สนับสนุนการสอบสวนอาชญากรรม
                และเพื่อตรวจสอบเหตุการณ์ด้านความมั่นคงและปลอดภัย
                ซึ่งรวมถึงการซักซ้อมฝึกอบรมด้านความปลอดภัย)
              </div>
              <div>• โดยทั่วไปรวมถึงการดำเนินการต่อไปนี้</div>
              <div>
                •
                ตรวจสอบข้อมูลดิบหรือข้อมูลซึ่งเราได้รับจากลูกค้านิติบุคคลหรือบุคคลภายนอกเพื่อวัตถุประสงค์อื่น
                ตลอดจนข้อมูลระบุตัวบุคคล อำนาจการอนุมัติ
                หรืออำนาจการกระทำการในนามของนิติบุคคลของท่านซึ่งเป็นลูกค้านิติบุคคลของเรา
                หรือคู่สัญญาอื่นในการเข้าทำสัญญากับเรา • ปฏิบัติตามนโยบาย
                ขั้นตอนปฏิบัติ มาตรฐานหรือการบริหารจัดการภายในของเดอะ
                เมมโมรี่บ็อกซ์
              </div>
              <div>
                {" "}
                •
                ดำเนินการกับบริษัทประกันภัยเพื่อประเมินความเสียหายและการเยียวยาในกรณีคำร้องเรียนของลูกค้า
              </div>
              <div>
                • รับคำปรึกษาจากสำนักงานกฎหมายภายนอก หรือผู้ให้บริการภายนอกอื่น
                ๆ และ{" "}
              </div>
              <div>
                • ก่อตั้งสิทธิเรียกร้อง ใช้สิทธิ
                หรือต่อสู้การใช้สิทธิเรียกร้องทางกฎหมาย
              </div>
            </div>
          </div>
          <div className="grid grid-cols-12 gap-3">
            <div className="grid col-span-12  sm:col-span-12 md:col-span-12 lg:col-span-12 xl:col-span-12 content-start mt-3 mb-4">
              ทั้งนี้ในกรณีใด ๆ ที่เป็นไปเพื่อประโยชน์โดยชอบด้วยกฎหมาย
              เราจะทำการประมวลผลข้อมูลส่วนบุคคลเท่าที่เหมาะสม
              และดำรงไว้ซึ่งผลประโยชน์หรือสิทธิขั้นพื้นฐานของท่าน
            </div>
          </div>
          <div className="grid grid-cols-12 gap-3">
            <div className="grid col-span-12  sm:col-span-12 md:col-span-12 lg:col-span-12 xl:col-span-12 content-start mt-3 mb-4 font-bold">
              (ง)
              เพื่อเคารพการใช้สิทธิของท่านในกรณีที่เราขอความยินยอมจากท่านในการประมวลผลข้อมูลบางประเภท
            </div>
          </div>
          <div className="grid grid-cols-12 gap-3">
            <div className="grid col-span-12  sm:col-span-12 md:col-span-12 lg:col-span-12 xl:col-span-12 content-start mt-3 mb-4">
              <div>
                • ประมวลผลข้อมูลประวัติอาชญากรรม
                และข้อมูลสุขภาพเพื่อวัตถุประสงค์ในการควบคุมด้านความปลอดภัยและสุขภาพ
                เพื่อให้เป็นไปตามขั้นตอนด้านความปลอดภัยของเรา และ
              </div>
              <div>
                • นำเสนอผลิตภัณฑ์หรือบริการที่หลายหลาก
                ซึ่งอาจแตกต่างจากผลิตภัณฑ์หรือบริการซึ่งเราได้นำเสนอแก่ท่าน
                แต่น่าจะสอดคล้องกับความสนใจของท่าน
                โดยการจัดทำรายการส่งเสริมการขายและการสื่อสารที่ปรับให้เหมาะกับตัวท่านในส่วนที่เกี่ยวกับตราสินค้า
                ผลิตภัณฑ์ บริการ หรือกิจกรรมของเรา
                ซึ่งเป็นผลมาจากการทำการตลาดที่ปรับให้เหมาะกับตัวลูกค้า
                ทั้งนี้รวมถึงการให้ข้อเสนอร่วมของตราสินค้าหลายตรา
                หรือข้อเสนอจากบริษัทในเครือหรือหุ้นส่วนธุรกิจของเรา
                ในการประมวลผลข้อมูลส่วนบุคคลบางประเภท
                เราจะจัดหาข้อมูลเฉพาะด้านแก่ท่าน
                และเสนอให้ท่านให้ความยินยอมกับการประมวลผลดังกล่าว
              </div>
            </div>
          </div>
          <div className="grid grid-cols-12 gap-3">
            <div className="grid col-span-12  sm:col-span-12 md:col-span-12 lg:col-span-12 xl:col-span-12 content-start mt-3 mb-4 font-bold">
              เดอะ เมมโมรี่บ็อกซ์เปิดเผยข้อมูลส่วนบุคคลให้กับบุคคลภายนอกหรือไม่?
            </div>
          </div>
          <div className="grid grid-cols-12 gap-3">
            <div className="grid col-span-12  sm:col-span-12 md:col-span-12 lg:col-span-12 xl:col-span-12 content-start mt-3 mb-4">
              เดอะ เมมโมรี่บ็อกซ์เปิดเผยข้อมูลส่วนบุคคลของท่านอย่างจำกัด
            </div>
          </div>
          <div className="grid grid-cols-12 gap-3">
            <div className="grid col-span-12  sm:col-span-12 md:col-span-12 lg:col-span-12 xl:col-span-12 content-start mt-3 mb-4">
              <div>
                • เราอาจเปิดเผยข้อมูลส่วนบุคคลของท่านเป็นการภายในองค์กรของเดอะ
                เมมโมรี่บ็อกซ์เพื่อวัตถุประสงค์ที่ใช้ในการเก็บรวบรวมข้อมูลส่วนบุคคลดังที่กล่าวมาข้างต้น
              </div>
              <div>
                •
                เราอาจเปิดเผยข้อมูลส่วนบุคคลของท่านกับบริษัทที่ให้บริการสนับสนุนแก่เรา
                (เช่น บริการประมวลผลบัตรเครดิต ผู้ให้บริการด้านการชำระเงินอื่น ๆ
                บริการฝากเว็บไซต์ (Website Hosting)
                บริการรับส่งอีเมลและไปรษณีย์ภัณฑ์
                ผู้ให้บริการลูกค้าที่จัดจ้างจากบุคคลภายนอก บริษัทประกันภัย
                สำนักงานกฎหมายภายนอก
                ผู้ให้บริการด้านพิธีการศุลกากรสำหรับสินค้านำเข้า
                สำนักไปรษณีย์หรือรับฝากเว็บไซต์
                และผู้ให้บริการด้านการจัดการข้อมูล)
                และกับบริษัทที่ช่วยเหลือด้านการทำตลาดผลิตภัณฑ์และบริการของเรา
                (เช่น ผู้ให้บริการอีเมล หรือบริษัทตัวแทนด้านการตลาด)
                ทั้งนี้บริษัทเหล่านี้อาจใช้ข้อมูลส่วนบุคคลของท่านในการปฏิบัติงานของตนในนามของเดอะ
                เมมโมรี่บ็อกซ์
              </div>
              <div>
                • เราอาจเปิดเผยข้อมูลบางประเภท (1)
                เมื่อได้รับการร้องขอที่ชอบด้วยกฎหมาย
                เพื่อดำเนินตามกระบวนการทางกฎหมาย
                และเมื่อจำต้องปฏิบัติตามกฎหมายหรือคำสั่งที่ชอบด้วยกฎหมายของหน่วยงานราชการ
                (2) เพื่อบังคับใช้สัญญา นโยบายองค์กร
                และข้อกำหนดในการใช้งานของเรา หรือ (3) เพื่อปกป้องสิทธิ
                ทรัพย์สินหรือความปลอดภัยของเดอะ เมมโมรี่บ็อกซ์ พนักงาน ลูกค้า
                พาร์เนอร์ของเรา (รวมเรียกว่า “พนักงาน”) ตัวแทน ลูกค้า
                และบุคคลอื่น ๆ
              </div>
              <div>
                •
                หากท่านเข้าใช้งานบล็อกหรือบอร์ดพูดคุยทางออนไลน์อื่นบนไซต์ของเรา
                ข้อมูลส่วนบุคคลใด ๆ ที่ท่านลงไว้ในไซต์ของเรา
                อาจมีการแชร์ออกไปยังผู้ใช้งานอื่น ๆ ในบอร์ดพูดคุยออนไลน์
                และผู้ที่เข้าเยี่ยมชมไซต์ของเรา
              </div>
              <div>
                • ในกรณีที่มีการควบรวมกิจการ เข้าซื้อกิจการ จัดหาเงินทุน
                หรือจำหน่ายสินทรัพย์หรือกรณีอื่นใดที่เกี่ยวข้องกับการโอนสินทรัพย์ทางธุรกิจของเราบางส่วนหรือทั้งหมด
                เราอาจเปิดเผยข้อมูลส่วนบุคคลของท่านกับบุคคลที่เกี่ยวข้องในการเจรจาต่อรองหรือโอนสินทรัพย์
                ทั้งนี้ หากมีการเปลี่ยนแปลงในธุรกิจของเราแล้ว
                ธุรกิจของเราในส่วนที่มีการขาย ได้มา หรือควบรวมกับบริษัทอื่น
                (แล้วแต่กรณี)
                อาจมีการใช้ข้อมูลของท่านในลักษณะเดียวกับที่อธิบายไว้ในเอกสารแจ้งฯ
                ฉบับนี้
              </div>
              <div>
                •
                เราอาจเปิดเผยข้อมูลส่วนบุคคลของท่านกับบุคคลอื่นใดซึ่งมีหน้าที่ต่อเราในการรักษาความลับของข้อมูล
                และ{" "}
              </div>
              <div>
                •
                เราอาจเปิดเผยข้อมูลของท่านในลักษณะที่ไม่สามารถระบุตัวบุคคลของท่านได้โดยตรง
                (เช่น
                ข้อมูลที่ไม่สามารถระบุตัวบุคคลที่เป็นเจ้าของข้อมูลหรือข้อมูลโดยรวม)
                เพื่อวัตถุประสงค์ในการวิเคราะห์ทางสถิติและวัตถุประสงค์ทางธุรกิจอื่น
                ๆ
              </div>
            </div>
          </div>
          <div className="grid grid-cols-12 gap-3">
            <div className="grid col-span-12  sm:col-span-12 md:col-span-12 lg:col-span-12 xl:col-span-12 content-start mt-3 mb-4 font-bold">
              เราโอนข้อมูลส่วนบุคคลของท่านออกนอกประเทศไทยหรือไม่?
            </div>
          </div>
          <div className="grid grid-cols-12 gap-3">
            <div className="grid col-span-12  sm:col-span-12 md:col-span-12 lg:col-span-12 xl:col-span-12 content-start mt-3 mb-4">
              เราอาจส่งหรือโอนข้อมูลส่วนบุคคลของท่านไปยังประเทศที่อยู่นอกประเทศไทย
              เพื่อส่งถึงบริษัทแม่และบริษัทในเครืออื่น ๆ ของเรา
              และผู้ให้บริการบุคคลภายนอกของเรา
              ซึ่งเป็นส่วนหนึ่งในการดำเนินธุรกิจตามปกติในการให้บริการของเรา
              (เช่น ผู้ให้บริการด้านเทคโนโลยีสารสนเทศของเรา)
            </div>
          </div>
          <div className="grid grid-cols-12 gap-3">
            <div className="grid col-span-12  sm:col-span-12 md:col-span-12 lg:col-span-12 xl:col-span-12 content-start mt-3 mb-4">
              ในกรณีการส่งหรือโอนข้อมูลระหว่างประเทศที่ส่งจากประเทศไทยไปยังอีกประเทศหนึ่ง
              จะกระทำต่อเมื่อเป็นการส่งหรือโอนข้อมูลส่วนบุคคลของท่านไปยังประเทศที่รับข้อมูลซึ่งคณะกรรมการคุ้มครองข้อมูลส่วนบุคคลแห่งประเทศไทยกำหนดว่ามีมาตรฐานการคุ้มครองข้อมูลส่วนบุคคลที่เพียงพอ
            </div>
          </div>
          <div className="grid grid-cols-12 gap-3">
            <div className="grid col-span-12  sm:col-span-12 md:col-span-12 lg:col-span-12 xl:col-span-12 content-start mt-3 mb-4">
              ในกรณีการส่งหรือโอนข้อมูลไปยังประเทศซึ่งคณะกรรมการคุ้มครองข้อมูลส่วนบุคคลยังมิได้กำหนดว่ามีมาตรฐานด้านการคุ้มครองข้อมูลส่วนบุคคลที่เพียงพอ
              เราอาจส่งหรือโอนข้อมูลในกรณีที่เป็นไปตามข้อยกเว้น (เช่น
              เป็นการจำเป็นเพื่อปฏิบัติตามสัญญาที่เราทำไว้กับท่าน)
              หรือนำมาตรการคุ้มครองมาตรการใดมาตรการหนึ่งดังต่อไปนี้มาใช้เพื่อให้มีการคุ้มครองข้อมูลส่วนบุคคลของท่าน
            </div>
          </div>
          <div className="grid grid-cols-12 gap-3">
            <div className="grid col-span-12  sm:col-span-12 md:col-span-12 lg:col-span-12 xl:col-span-12 content-start mt-3 mb-4">
              <div>• การใช้ข้อสัญญามาตรฐาน (Standard Contractual Clauses)</div>
              <div>
                • การใช้นโยบายคุ้มครองข้อมูลส่วนบุคคลของเครือกิจการ (Binding
                Corporate Rules: BCRs)
                ซึ่งได้รับอนุมัติโดยสำนักงานคณะกรรมการคุ้มครองข้อมูลส่วนบุคคล
              </div>
            </div>
          </div>
          <div className="grid grid-cols-12 gap-3">
            <div className="grid col-span-12  sm:col-span-12 md:col-span-12 lg:col-span-12 xl:col-span-12 content-start mt-3 mb-4 font-bold">
              เราเก็บรักษาข้อมูลส่วนบุคคลของท่านนานเพียงใด?
            </div>
          </div>
          <div className="grid grid-cols-12 gap-3">
            <div className="grid col-span-12  sm:col-span-12 md:col-span-12 lg:col-span-12 xl:col-span-12 content-start mt-3 mb-4">
              เราจะเก็บข้อมูลส่วนบุคคลของท่านที่ถูกประมวลผลภายใต้เอกสารแจ้งฯ นี้
              ไว้เท่าที่จำเป็นในระหว่างระยะเวลาที่ท่านใช้บริการกับเรา
              ทั้งนี้เป็นระยะเวลาเท่าที่จำเป็นเพื่อให้บรรลุวัตถุประสงค์ที่ได้ระบุไว้ในเอกสารแจ้งฯ
              นี้ รวมถึงระหว่างระยะเวลาเปลี่ยนถ่าย (เช่น
              การปฏิบัติตามหน้าที่ในการเก็บข้อมูลตามที่กำหนดโดยกฎหมายที่ใช้บังคับ)
              หรือเพื่อการดำเนินการกับการใช้สิทธิเรียกร้องตามกฎหมาย
              หรือการร้องขอด้านการกำกับดูแล (หากมี)
            </div>
          </div>
          <div className="grid grid-cols-12 gap-3">
            <div className="grid col-span-12  sm:col-span-12 md:col-span-12 lg:col-span-12 xl:col-span-12 content-start mt-3 mb-4">
              โดยหลักการแล้ว
              เราจะเก็บข้อมูลส่วนบุคคลของท่านตามระยะเวลาเท่าที่กฎหมายที่ใช้บังคับกำหนดหรืออนุญาตให้กระทำได้
              ตัวอย่างเช่น ข้อมูลของลูกค้าและ/หรือคู่สัญญา ส่วนใหญ่ของเรา
              จะจัดเก็บไว้ในระหว่างที่ยังมีสัญญาอยู่ และเก็บต่อไปอีก 10
              ปีหลังจากสิ้นสุดสัญญา
              ทั้งนี้ตามบทบัญญัติโดยทั่วไปด้านอายุความภายใต้กฎหมายไทย
            </div>
          </div>
          <div className="grid grid-cols-12 gap-3">
            <div className="grid col-span-12  sm:col-span-12 md:col-span-12 lg:col-span-12 xl:col-span-12 content-start mt-3 mb-4">
              เมื่อไม่มีความจำเป็นต้องใช้ข้อมูลส่วนบุคคลอีกต่อไป
              หรือในกรณีใดหลังจากเราไม่มีฐานทางกฎหมายในการเก็บข้อมูลส่วนบุคคลไว้
              เราจะนำข้อมูลส่วนบุคคลของท่านออกจากระบบงานและบันทึกของเรา
              และ/หรือดำเนินขั้นตอนที่เหมาะสมเพื่อทำให้เป็นข้อมูลที่ไม่สามารถระบตัวบุคคลที่เป็นเจ้าของข้อมูลได้
            </div>
          </div>
          <div className="grid grid-cols-12 gap-3">
            <div className="grid col-span-12  sm:col-span-12 md:col-span-12 lg:col-span-12 xl:col-span-12 content-start mt-3 mb-4 font-bold">
              ท่านมีสิทธิอะไรบ้างตามกฎหมาย และเดอะ
              เมมโมรี่บ็อกซ์นำเสนอทางเลือกใดที่เกี่ยวข้องกับข้อมูลส่วนบุคคลให้แก่ท่านบ้าง
            </div>
          </div>
          <div className="grid grid-cols-12 gap-3">
            <div className="grid col-span-12  sm:col-span-12 md:col-span-12 lg:col-span-12 xl:col-span-12 content-start mt-3 mb-4">
              เราเชื่อในการให้ท่านควบคุมข้อมูลส่วนบุคคลของท่าน
              ท่านมีสิทธิดังต่อไปนี้ซึ่งอยู่ภายใต้เงื่อนไขกฎหมายและกฎระเบียบที่ใช้บังคับโดยเป็นไปตามเงื่อนไขและข้อกำหนดของกฎหมายและกฎระเบียบดังกล่าว
            </div>
          </div>
          <div className="grid grid-cols-12 gap-3">
            <div className="grid col-span-12  sm:col-span-12 md:col-span-12 lg:col-span-12 xl:col-span-12 content-start mt-3 mb-4">
              สิทธิในการเข้าถึง
              ท่านมีสิทธิที่จะเข้าถึงข้อมูลส่วนบุคคลของท่านซึ่งอยู่ภายใต้ความรับผิดชอบของเรา
              หรือขอให้เราเปิดเผยวิธีการได้มาซึ่งข้อมูลส่วนบุคคลของท่านที่ท่านไม่ได้ให้ความยินยอม
              ท่านมีสิทธิขอรับสำเนาของการประมวลผลข้อมูลส่วนบุคคลของท่าน
              สำหรับสำเนาฉบับเพิ่มเติมจำนวนหนึ่งฉบับหรือมากกว่าที่ท่านขอรับจากเรา
              เราอาจคิดค่าธรรมเนียมในการจัดการตามสมควรโดยสอดคล้องกับที่กำหนดไว้ในพระราชบัญญัติคุ้มครองข้อมูลส่วนบุคคล
              พ.ศ. 2562
            </div>
          </div>
          <div className="grid grid-cols-12 gap-3">
            <div className="grid col-span-12  sm:col-span-12 md:col-span-12 lg:col-span-12 xl:col-span-12 content-start mt-3 mb-4">
              สิทธิในการแก้ไข
              ท่านมีสิทธิได้รับการแก้ไขข้อมูลส่วนบุคคลของท่านที่ไม่ถูกต้องหรือไม่สมบูรณ์ให้มีความถูกต้อง
              เป็นปัจจุบัน และไม่ก่อให้เกิดความเข้าใจผิดได้
            </div>
          </div>
          <div className="grid grid-cols-12 gap-3">
            <div className="grid col-span-12  sm:col-span-12 md:col-span-12 lg:col-span-12 xl:col-span-12 content-start mt-3 mb-4">
              สิทธิในการขอให้ลบข้อมูล ท่านมีสิทธิขอให้เราทำการลบ ทำลาย
              หรือทำให้ข้อมูลส่วนบุคคลเป็นข้อมูลที่ไม่สามารถระบุตัวบุคคลที่เป็นเจ้าของข้อมูลส่วนบุคคลได้
              ภายใต้ขอบเขตที่กฎหมายกำหนด
              โปรดทราบว่าสิทธิโดยสมบูรณ์ที่จะขอให้ข้อมูลส่วนบุคคลทั้งหมดของท่านถูกลบไป
              เราจะพิจารณาแต่ละคำขออย่างระมัดระวังโดยสอดคล้องกับข้อกำหนดของกฎหมายที่เกี่ยวข้องกับการประมวลผลข้อมูลส่วนบุคคลของท่าน
            </div>
          </div>
          <div className="grid grid-cols-12 gap-3">
            <div className="grid col-span-12  sm:col-span-12 md:col-span-12 lg:col-span-12 xl:col-span-12 content-start mt-3 mb-4">
              สิทธิในการขอให้โอนย้ายข้อมูล
              ท่านมีสิทธิในการได้รับข้อมูลส่วนบุคคลของท่านที่ได้ให้ไว้แก่เรา
              เว้นแต่จะไม่สามารถดำเนินการได้ด้วยข้อจำกัดทางเทคนิค
              และหากเป็นกรณีที่สามารถดำเนินการได้ทางเทคนิค
              ท่านมีสิทธิที่จะขอให้เราส่ง
              หรือโอนข้อมูลส่วนบุคคลของท่านในรูปแบบต่าง ๆ
              ไปยังผู้ควบคุมส่วนบุคคลรายอื่นโดยตรงด้วยวิธีการอัตโนมัติ
            </div>
          </div>
          <div className="grid grid-cols-12 gap-3">
            <div className="grid col-span-12  sm:col-span-12 md:col-span-12 lg:col-span-12 xl:col-span-12 content-start mt-3 mb-4">
              สิทธิในการคัดค้าน ท่านมีสิทธิในการคัดค้านการเก็บรวบรวม ใช้
              หรือเปิดเผยข้อมูลส่วนบุคคลด้วยเหตุบางประการที่เกี่ยวข้องกับสถานการณ์ของท่านตามที่กำหนดไว้ในกฎหมาย
              หากท่านยื่นคำคัดค้าน เราจะยังดำเนินการเก็บรวบรวม ใช้
              หรือเปิดเผยข้อมูลส่วนบุคคลของท่านเท่าที่เราสามารถแสดงให้เห็นถึงเหตุอันชอบด้วยกฎหมายที่สำคัญยิ่งกว่าประโยชน์
              สิทธิ และอิสรภาพของท่าน หรือในกรณีที่การเก็บรวบรวม ใช้
              หรือเปิดเผยข้อมูลนั้นเป็นไปเพื่อการก่อตั้งสิทธิเรียกร้องตามกฎหมาย
              การใช้สิทธิเรียกร้องตามกฎหมาย
              หรือการยกขึ้นต่อสู้สิทธิเรียกร้องตามกฎหมาย
              หรือการศึกษาวิจัยทางวิทยาศาสตร์ ประวัติศาสตร์ หรือสถิติ
              แล้วแต่กรณี
            </div>
          </div>
          <div className="grid grid-cols-12 gap-3">
            <div className="grid col-span-12  sm:col-span-12 md:col-span-12 lg:col-span-12 xl:col-span-12 content-start mt-3 mb-4">
              สิทธิในการเพิกถอนความยินยอม
              หากท่านได้ให้ความยินยอมแก่เราในการเก็บรวบรวม ใช้
              หรือเปิดเผยข้อมูลส่วนบุคคลของท่าน
              ท่านสามารถเพิกถอนความยินยอมของท่านได้ตลอดเวลา
            </div>
          </div>
          <div className="grid grid-cols-12 gap-3">
            <div className="grid col-span-12  sm:col-span-12 md:col-span-12 lg:col-span-12 xl:col-span-12 content-start mt-3 mb-4">
              สิทธิในการร้องเรียน
              ท่านมีสิทธิในการยื่นข้อร้องเรียนต่อหน่วยงานที่กำกับดูแลเรื่องการคุ้มครองข้อมูลส่วนบุคคล
              ในกรณีที่ท่านเห็นว่า เรา
              รวมถึงพนักงานหรือผู้ให้บริการของเราฝ่าฝืนหรือไม่ปฏิบัติตามพระราชบัญญัติคุ้มครองข้อมูลส่วนบุคคล
              พ.ศ. 2562 หรือประกาศที่ออกภายใต้พระราชบัญญัติดังกล่าว
            </div>
          </div>
          <div className="grid grid-cols-12 gap-3">
            <div className="grid col-span-12  sm:col-span-12 md:col-span-12 lg:col-span-12 xl:col-span-12 content-start mt-3 mb-4">
              เดอะ
              เมมโมรี่บ็อกซ์นำเสนอทางเลือกหลายประการให้แก่ท่านในการปรับปรุงหรือเปลี่ยนแปลงข้อมูลส่วนบุคคลของท่าน
              และวิธีการที่เราจะสื่อสารกับท่าน
              โปรดดำเนินการตามข้อแนะนำในการยกเลิกการรับข้อมูลข่าวสารในอีเมลส่งเสริมการขายที่ส่งให้แก่ท่าน
            </div>
          </div>
          <div className="grid grid-cols-12 gap-3">
            <div className="grid col-span-12  sm:col-span-12 md:col-span-12 lg:col-span-12 xl:col-span-12 content-start mt-3 mb-4">
              หากท่านยกเลิกการรับการสื่อสารที่เกี่ยวข้องกับการส่งเสริมการขายจากเรา
              เราอาจยังคงทำการสื่อสารในเรื่องที่ไม่ใช่การส่งเสริมการขายไปยังท่าน
              เช่น อีเมลที่เกี่ยวข้องกับบัญชีผู้ใช้ของท่าน
              และความสัมพันธ์ทางธุรกิจของเรา
            </div>
          </div>
          <div className="grid grid-cols-12 gap-3">
            <div className="grid col-span-12  sm:col-span-12 md:col-span-12 lg:col-span-12 xl:col-span-12 content-start mt-3 mb-4">
              โดยปกติแล้วท่านสามารถตั้งค่าโปรแกรมค้นหาข้อมูลของท่านให้เตือนท่านหากมีการส่งข้อมูลคุกกี้
              หรือเพื่อนำออก หรือปฏิเสธข้อมูลคุกกี้
              โปรแกรมค้นหาข้อมูลแต่ละโปรแกรมนั้นมีความแตกต่างกันเล็กน้อย
              โปรดดูที่รายการ “ช่วยเหลือ”
              เพื่อเรียนรู้เกี่ยวกับวิธีการที่ถูกต้องในการปรับแต่งการตั้งค่าข้อมูลคุกกี้ของท่าน
              หากท่านเลือกที่จะนำออกหรือปฏิเสธข้อมูลคุกกี้
              การกระทำดังกล่าวอาจกระทบคุณสมบัติการใช้งาน หรือบริการบนไซต์ของเรา
            </div>
          </div>
          <div className="grid grid-cols-12 gap-3">
            <div className="grid col-span-12  sm:col-span-12 md:col-span-12 lg:col-span-12 xl:col-span-12 content-start mt-3 mb-4">
              หากท่านต้องการใช้สิทธิที่ระบุข้างต้น
              โปรดยื่นแบบคำร้องข้อมูลส่วนบุคคลที่ปรากฏดังนี้
            </div>
          </div>
          <div className="grid grid-cols-12 gap-3">
            <div className="grid col-span-12  sm:col-span-12 md:col-span-12 lg:col-span-12 xl:col-span-12 content-start mt-3 mb-4">
              1. แบบคำร้องข้อมูลส่วนบุคคลสำหรับสมาชิก The MemoryBox® M-Coin
              (คลิกที่นี่)
            </div>
          </div>
          <div className="grid grid-cols-12 gap-3">
            <div className="grid col-span-12  sm:col-span-12 md:col-span-12 lg:col-span-12 xl:col-span-12 content-start mt-3 mb-4">
              2. แบบคำร้องข้อมูลส่วนบุคคล (คลิกที่นี่)
            </div>
          </div>
          <div className="grid grid-cols-12 gap-3">
            <div className="grid col-span-12  sm:col-span-12 md:col-span-12 lg:col-span-12 xl:col-span-12 content-start mt-3 mb-4">
              เราอาจจำเป็นต้องขอข้อมูลจำเพาะบางประการจากท่านเพื่อยืนยันตัวตนของท่าน
              และเพื่อให้แน่ใจเรื่องสิทธิของท่านในการเข้าถึงข้อมูลของท่าน
              (หรือเพื่อใช้สิทธิประการอื่นของท่าน)
              นี่คือมาตรการเพื่อความปลอดภัยเพื่อให้แน่ใจว่าข้อมูลของท่านจะไม่ถูกเปิดเผยให้แก่บุคคลใดซึ่งไม่มีสิทธิได้รับข้อมูลดังกล่าว
              โปรดนำส่งไฟล์สแกน/สำเนาเอกสารยืนยันตัวตนของท่านเพื่อวัตถุประสงค์ในการยืนยันตัวตนหากมีการร้องขอเอกสารดังกล่าว
            </div>
          </div>
          <div className="grid grid-cols-12 gap-3">
            <div className="grid col-span-12  sm:col-span-12 md:col-span-12 lg:col-span-12 xl:col-span-12 content-start mt-3 mb-4">
              ท่านจะไม่ต้องชำระค่าธรรมเนียมในการเข้าถึงข้อมูลของท่าน
              (หรือเพื่อใช้สิทธิประการอื่น) อย่างไรก็ตาม
              เราอาจคิดค่าธรรมเนียมตามสมควรหากว่าคำขอของท่านนั้นเป็นคำขอที่ไม่สมเหตุสมผล
              ซ้ำซ้อน หรือเกินสมควร
              หรือเราอาจปฏิเสธที่จะดำเนินการตามคำขอของท่านในกรณีดังกล่าวข้างต้น
            </div>
          </div>
          <div className="grid grid-cols-12 gap-3">
            <div className="grid col-span-12  sm:col-span-12 md:col-span-12 lg:col-span-12 xl:col-span-12 content-start mt-3 mb-4">
              ตามกฎระเบียบที่ใช้บังคับ นอกเหนือจากสิทธิของท่านข้างต้นแล้วนั้น
              ท่านมีสิทธิที่จะยื่นข้อร้องเรียน ในกรณีที่ท่านเห็นว่า เรา
              รวมถึงพนักงานของเราฝ่าฝืนหรือไม่ปฏิบัติตามพระราชบัญญัติคุ้มครองข้อมูลส่วนบุคคล
              พ.ศ. 2562 หรือประกาศที่ออกภายใต้พระราชบัญญัติดังกล่าว
              ต่อคณะกรรมการคุ้มครองข้อมูลส่วนบุคคล
            </div>
          </div>
          <div className="grid grid-cols-12 gap-3">
            <div className="grid col-span-12  sm:col-span-12 md:col-span-12 lg:col-span-12 xl:col-span-12 content-start mt-3 mb-4">
              เราพยายามที่จะตอบสนองต่อคำร้องที่มีเหตุอันสมควรภายใน 30 วัน
              แต่บางกรณีอาจจำเป็นต้องใช้เวลาเกินกว่า 30
              วันหากคำร้องของท่านนั้นมีความซับซ้อนหรือท่านยื่นคำร้องจำนวนมาก
              ในกรณีนี้ เราจะแจ้งให้ท่านทราบและรายงานความคืบหน้าแก่ท่านเป็นระยะ
            </div>
          </div>
          <div className="grid grid-cols-12 gap-3">
            <div className="grid col-span-12  sm:col-span-12 md:col-span-12 lg:col-span-12 xl:col-span-12 content-start mt-3 mb-4 font-bold">
              หากท่านเป็นผู้เยาว์?
            </div>
          </div>
          <div className="grid grid-cols-12 gap-3">
            <div className="grid col-span-12  sm:col-span-12 md:col-span-12 lg:col-span-12 xl:col-span-12 content-start mt-3 mb-4">
              เรายินดีเปิดรับทุกท่านเข้าเป็นลูกค้าผู้ทรงคุณค่าของเรา
              และเป็นส่วนหนึ่งของชุมชนชาวเมมโมรี่บ็อกซ์
              อย่างไรก็ตามหากท่านมีอายุต่ำกว่า 20 ปีบริบูรณ์
              ก่อนเข้าใช้บริการของเรา หรือมีปฏิสัมพันธ์ในทางใด ๆ กับเรา
              ท่านจะต้องได้รับความยินยอมจากผู้ปกครองตามกฎหมายของท่านก่อน
            </div>
          </div>
          <div className="grid grid-cols-12 gap-3">
            <div className="grid col-span-12  sm:col-span-12 md:col-span-12 lg:col-span-12 xl:col-span-12 content-start mt-3 mb-4 font-bold">
              ข้อมูลส่วนบุคคลได้รับการคุ้มครองอย่างไร?
            </div>
          </div>
          <div className="grid grid-cols-12 gap-3">
            <div className="grid col-span-12  sm:col-span-12 md:col-span-12 lg:col-span-12 xl:col-span-12 content-start mt-3 mb-4">
              เดอะ เมมโมรี่บ็อกซ์มีการดำเนินการตามขั้นตอนตามสมควร
              เพื่อให้มีความปลอดภัยด้านกายภาพ ด้านเทคนิค
              และการจัดการที่เหมาะสมเพื่อช่วยป้องกันการสูญเสีย
              การใช้ในทางที่ไม่ถูกต้อง การเข้าถึง
              การเปิดเผยหรือการเปลี่ยนแปลงข้อมูลส่วนบุคคลโดยไม่ได้รับอนุญาต
            </div>
          </div>
          <div className="grid grid-cols-12 gap-3">
            <div className="grid col-span-12  sm:col-span-12 md:col-span-12 lg:col-span-12 xl:col-span-12 content-start mt-3 mb-4">
              อนึ่ง
              แม้ว่าเราได้ดำเนินความพยายามตามสมควรเพื่อปกป้องข้อมูลส่วนบุคคลของท่าน
              แต่ไม่มีระบบข้อมูลหรือการโอนถ่ายข้อมูลทางอินเตอร์เน็ตหรือผ่านเครือข่ายสาธารณะอื่นใดที่สามารถรับประกันความปลอดภัยได้โดยสมบูรณ์
              ทั้งนี้ท่านมีความรับผิดชอบในการปกป้องรหัสผ่านของท่าน
              และรักษาความปลอดภัยของอุปกรณ์สื่อสารของท่าน
            </div>
          </div>
          <div className="grid grid-cols-12 gap-3">
            <div className="grid col-span-12  sm:col-span-12 md:col-span-12 lg:col-span-12 xl:col-span-12 content-start mt-3 mb-4 font-bold">
              การปรับปรุงเอกสารแจ้งฯ ฉบับนี้
            </div>
          </div>
          <div className="grid grid-cols-12 gap-3">
            <div className="grid col-span-12  sm:col-span-12 md:col-span-12 lg:col-span-12 xl:col-span-12 content-start mt-3 mb-4">
              เอกสารแจ้งฯ นี้มีผลใช้บังคับในวันที่ที่ระบุไว้ในตอนต้นของหน้านี้
              เราอาจมีการปรับปรุงเอกสารแจ้งฯ นี้เป็นครั้งคราว
            </div>
          </div>
          <div className="grid grid-cols-12 gap-3">
            <div className="grid col-span-12  sm:col-span-12 md:col-span-12 lg:col-span-12 xl:col-span-12 content-start mt-3 mb-4">
              เราจะแจ้งกับท่านผ่านทางไซต์ของเรา
              หรือช่องทางการสื่อสารอื่นที่ใช้ตามปกติของเราถึงการเปลี่ยนแปลงใดที่มีนัยสำคัญอันอาจกระทบต่อการเก็บรวบรวม
              ใช้หรือเปิดเผยข้อมูลส่วนบุคคลของท่าน
              ขอให้ท่านคอยตรวจสอบว่ามีการปรับปรุงและเปลี่ยนแปลงเอกสารแจ้งฯ
              นี้หรือไม่ โดยพิจารณาจากวันที่ของเอกสารแจ้งฯ
              นี้เมื่อท่านเข้าเยี่ยมชมไซต์ของเรา
            </div>
          </div>
          <div className="grid grid-cols-12 gap-3">
            <div className="grid col-span-12  sm:col-span-12 md:col-span-12 lg:col-span-12 xl:col-span-12 content-start mt-3 mb-4 font-bold">
              การติดต่อกับเรา
            </div>
          </div>
          <div className="grid grid-cols-12 gap-3">
            <div className="grid col-span-12  sm:col-span-12 md:col-span-12 lg:col-span-12 xl:col-span-12 content-start mt-3 mb-4">
              เรายินดีตอบรับคำถาม ความเห็น
              และความกังวลของท่านที่เกี่ยวกับการประมวลผลข้อมูลส่วนบุคคลของท่านภายใต้เอกสารแจ้งฯ
              นี้ ทั้งนี้ท่านอาจติดต่อกับเราโดยทางอีเมลที่ hello@memorybox.store
              หรือทางโทรศัพท์ที่ 089-176-5252
            </div>
          </div>
          <div className="grid grid-cols-12 gap-3">
            <div className="grid col-span-12  sm:col-span-12 md:col-span-12 lg:col-span-12 xl:col-span-12 content-start mt-3 mb-4">
              บริษัท เดอะ เมมโมรี่บ็อกซ์ จำกัด 126/33 ม.5 ต.รัษฎา อ.เมืองภูเก็ต
              จ.ภูเก็ต 83000 ประเทศไทย
            </div>
          </div>
        </div>
      </div>
      <section className="block fixed inset-x-0 bottom-0 z-10 bg-white shadow py-2  mb-[67px] border ">
        <div className="grid grid-cols-12 mb-4">
          <div className=" col-span-12 sm:px-4 justify-center text-center ">
            {/*  <CheckBox
              defaultValue={false}
              ref={chkbox}
              text="ท่านยอมรับว่าเป็นภาพของตนเอง"
            /> */}
            <input type="checkbox" ref={chkbox} />
            <label> ท่านยอมรับว่าเป็นภาพของตนเอง</label>
          </div>
        </div>
        <div className="grid grid-cols-12 ">
          <div className="grid col-span-12 sm:px-4 justify-center text-center ">
            <button className="btn-save px-16" onClick={approve}>
              ยืนยัน
            </button>
          </div>
        </div>
      </section>
    </>
  );
}
